{"link": "https://myanimelist.net/manga/147272/The_Greatest_Estate_Developer", "details": {"title": "The Greatest Estate Developer", "alt_title": " The World's Best Engineer, The Greatest Estate Designer, Yeokdaegeup Yeongji Seolgyesa", "creators": " Moon, Back-kyung (Story), Kim, Hyunsoo (Art)", "summary": "There is no bigger scum of the earth than Lloyd Frontera. He is the eldest son, yet all he does is drink and intimidate others, depleting what little is left of his family's wealth. The Fronteras' knight, Javier Asrahan, is destined to become a renowned swordmaster, and Lloyd's family will face pitiful deaths as their entire land falls to ruin under insurmountable debt. Though at some point Kim Suho was an average civil engineering student in Korea, he suddenly wakes up on a dirt road as none other than Lloyd, an ungrateful hooligan from the beginning of a book following Javier, the protagonist. While a sassy status window offers some clarity about his new identity, Suho is rather worried about his imminent downfall. To avoid becoming a beggar—and ultimately lead a sweet and comfortable life—Suho decides to fix Lloyd's scumbag image. With his engineering expertise and magical construction skills boost, Suho introduces modern innovations and city developments to this medieval-like world, drastically improving the people's quality of life—all for a nice sum of money. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/147769/No_Home", "details": {"title": "No Home", "alt_title": " Jib-i Eopseo", "creators": " Wanan (Story & Art)", "summary": "The abandoned dormitory on the school's outskirts is haunted: the floors creak, creepy sounds fill the night's air, and only the bravest souls dare venture into this den of real-life ghosts. For Go Haejun, a second-year high school student who can see ghosts, it is the sole housing option after he misses the deadline to apply for a newer, safer dormitory. Things would not be so terrible if his only cohabitant were not a brazen and cheeky first-year student, Baek Eunyeong. Eunyeong also happens to be the one responsible for destroying Haejun's plans by shamelessly stealing and wasting all of Haejun's savings. On top of that, he is sloppy, parties constantly, and lies as easily as he breathes. Haejun wrestles with unresolved guilt after fighting with his mother and running away, but he lacks patience for Eunyeong's childish acting out. No matter their vast differences and how much they hate each other, Haejun and Eunyeong are forced to coexist, as neither has another place to call home. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/178182/On_the_Way_to_Meet_Mom", "details": {"title": "On the Way to Meet Mom", "alt_title": " On the Way to See My Mom", "creators": " Gomyang (Story & Art)", "summary": "Only some children in the orphanage are lucky enough to have a patron—and a small, curious child named Mori starts receiving gifts one day. Mori does not speak, but he listens and enjoys the company of his friend, Rowena, who tells him everything he needs to know. But once Rowena disappears in the warm embrace of her mother, Mori realizes one thing: if every child has a mother, then his own must be out there somewhere. Having packed his little bag, put on his boots, and donned a red cape—undoubtedly a gift from his mother—Mori sets foot outside of the orphanage and begins his journey. The outside world is dangerous; ever since aliens took over Earth, humans have dwindled in numbers, and various creatures roam the vast lands and build their settlements. Ryder, a scarlet-skinned alien with horns and five eyes, encounters Mori and, realizing his origins and the dangers that await him, decides to help Mori's quest and protect him until he meets his mom. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/125036/The_Horizon", "details": {"title": "The Horizon", "alt_title": "no alt title", "creators": " Jeong, Ji-Hoon (Story & Art)", "summary": "In a world ravaged by war, a young boy walks down a lonely road in the aftermath of his mother's death. Along his journey, he witnesses military tanks, dead bodies, and his beloved city in ruins. With eyes clouded by anguish, he pushes himself to keep moving forward. One morning, he meets a girl in an abandoned bus where he spent the night. Moments after their encounter, the area turns into a battlefield, and the pair escapes into a long abandoned lane. The two strangers decide to walk together to the end of the road, thus beginning a companionship that will ignite new hope inside their shriveled hearts. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/178671/My_Bias_Gets_on_the_Last_Train", "details": {"title": "My Bias Gets on the Last Train", "alt_title": "no alt title", "creators": " Jixksee (Story & Art)", "summary": "Every night, Yeo-un takes the last train home—same route, same time, same routine. But one thing keeps catching his eye: a girl with a guitar and a presence that lingers in his mind. When a shared love for the indie band Long Afternoon sparks a conversation, their late-night encounters begin to turn into something more. But Hae-in isn't just another fan—she's the voice behind the band, a secret she can't afford to reveal. As music draws them closer, the truth may threaten to pull them apart. When the final note plays, will their story end in harmony... or heartbreak? (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/132214/Omniscient_Readers_Viewpoint", "details": {"title": "Omniscient Reader's Viewpoint", "alt_title": " Jeonji-jeok Dokja Sijeom", "creators": " sing N song (Story), Sleepy-C (Art)", "summary": "Kim Dokja does not consider himself the protagonist of his own life. Befitting the name his parents gave him, he is a solitary person whose sole hobby is reading web novels. For over a decade, he has lived vicariously through Yoo Joonghyuk, the main character of the web novel Three Ways to Survive the Apocalypse (TWSA). Through Joonghyuk, Dokja has experienced secondhand the trials of repeatedly regressing in time, in search of an end to life-threatening \"scenarios\" that force people to act out narratives for the amusement of god-like \"Constellations.\" After reading 3,149 chapters—long after all other readers lost interest—Dokja finally resigns himself to the story ending. However, he receives an enigmatic message from the author, stating that the story will soon be monetized, before his surroundings suddenly go dark. He swiftly realizes that fiction has become reality and he is now living through TWSA. Although he is the singular omniscient reader of the events yet to come, his success in the scenarios is not guaranteed—but perhaps his advantage will empower him to step into the protagonist role that never suited him before. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/121496/Solo_Leveling", "details": {"title": "Solo Leveling", "alt_title": " Na Honjaman Level Up, I Level Up Alone", "creators": " Chugong (Story), Jang, Sung-rak (Art), Disciples (Art)", "summary": "Ten years ago, \"the Gate\" appeared and connected the real world with the realm of magic and monsters. To combat these vile beasts, ordinary people received superhuman powers and became known as \"Hunters.\" Twenty-year-old Sung Jin-Woo is one such Hunter, but he is known as the \"World's Weakest,\" owing to his pathetic power compared to even a measly E-Rank. Still, he hunts monsters tirelessly in low-rank Gates to pay for his mother's medical bills. However, this miserable lifestyle changes when Jin-Woo—believing himself to be the only one left to die in a mission gone terribly wrong—awakens in a hospital three days later to find a mysterious screen floating in front of him. This \"Quest Log\" demands that Jin-Woo completes an unrealistic and intense training program, or face an appropriate penalty. Initially reluctant to comply because of the quest's rigor, Jin-Woo soon finds that it may just transform him into one of the world's most fearsome Hunters. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/103237/Wind_Breaker", "details": {"title": "Wind Breaker", "alt_title": "no alt title", "creators": " Jo, Yongseok (Story & Art)", "summary": "Burdened with expectations since childhood, second-year high schooler Jo \"Jay\" Ja-Hyun feels obligated to aim for the top through his studies. Despite obtaining the title of student president at Taeyang High, he continues to study diligently, giving him little time to befriend others. However, possessing an exceptional talent for biking with a technique that astonishes other experienced bikers, there is more to him than meets the eye. One afternoon, while Jay is skidding his bike at high speed, he catches the interest of his classmate, Yoon Minu. Amazed by his unparalleled biking skill, Minu is quick to recruit him to his biking crew, but Jay coldly rejects the offer. With a determination to show Jay the fun of riding with others, Minu proposes a simple deal—to race against a member of his team, promising to leave him alone if he wins. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/145539/Seasons_of_Blossom", "details": {"title": "Seasons of Blossom", "alt_title": " Cheongchun Blossom", "creators": " Hongduck (Story), NEMONE (Art)", "summary": "Oh, to be young and in love. Oh, to be wild and carefree. The springtime of life is intense, tumultuous, and at times, oh so confusing. Spring, summer, fall and winter—love blossoms in all seasons. (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/134744/The_Legend_of_the_Northern_Blade", "details": {"title": "The Legend of the Northern Blade", "alt_title": " Bukgeom Jeongi", "creators": " Woogack (Story), Hae, Min (Art)", "summary": "For decades, the brave warriors of the Northern Heavenly Sect fought to keep the world safe from the evil Silent Night. But when the fourth generation leader is accused of colluding with the enemy, he is forced to disband the sect and commit suicide to protect his son, Moowon. With no family and allies left, Moowon leads a dreary life under close surveillance... until a surprise attack from the Silent Night gives him a chance to escape to the mountains. There, the young warrior trains to master the fighting techniques of his predecessors, before the mysterious disappearance of a loved one brings him back to the mainland. Follow Moowon as he embarks on a journey to avenge his father's death and take down the villains who threaten to plunge the world into darkness! (Source: Tappytoon)"}}
{"link": "https://myanimelist.net/manga/164926/Webtoon_Character_Na_Kang_Lim", "details": {"title": "Webtoon Character Na Kang Lim", "alt_title": " Suyo Webtoon-ui Na Kang Lim", "creators": " Lee, Kyeongmin (Story), Song, Junhyeok (Art)", "summary": "Na Kang Lim, a high school student who enjoys reading webtoons, experiences a strange event one day when the female lead from his favorite webtoon appears before him. Even more surprising, the same incidents that put her in danger in the webtoon start happening in real life. The problem is, there's no protagonist in the real world to save her! Ultimately, Na Kang Lim takes on the role of the protagonist, looping through time to save her. (Source: Naver Corporation, translated)"}}
{"link": "https://myanimelist.net/manga/147171/Eleceed", "details": {"title": "Eleceed", "alt_title": "no alt title", "creators": " Kim, Hye-Jin (Art), Son, Jae-Ho (Story)", "summary": "Jiwoo is a kind-hearted young man who harnesses the lightning quick reflexes of a cat to secretly make the world a better place—one saved little child or foster pet at a time. Kayden is a secret agent on the run, who finds himself stuck in the body of a...um...decidedly fat old fluffy cat. Together, armed with Jiwoo's super powers and Kayden's uber-smarts, they're out to fight those forces who would let evil rule this world. That is, if they can stand each other long enough to get the job done. (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/147448/After_School_Lessons_for_Unripe_Apples", "details": {"title": "After School Lessons for Unripe Apples", "alt_title": " 20th Century Green Apple School, 90's Cram School for Unripe Apples, Segimal Putsagwa Boseup Hagwon", "creators": " Soonkki (Story & Art)", "summary": "Kim Cheol detests nothing more than attention, yet his oppressive height and a scar under his eye make him stick out like a sore thumb. In contrast, Cheol's new seatmate, Hwang Mi-ae, is incredibly outgoing and the shortest in their class. They look comical next to each other, and to add to their embarrassment, their names are the same as those of a famous but extremely ridiculous dancing duo. Cheol struggles with controlling his temper and avoids others by any means necessary, while all Mi-ae is interested in are comics, her favorite boy band, and going out with her friends. However, he is her new neighbor, and they even knew each other in early childhood. Despite everyone's fear of Cheol, Mi-ae notices his awkwardness and selfless nature and tries to befriend him. He may be difficult to approach for now, but through the busy days of studying for the high school entrance exams, Cheol will soon become Mi-ae's most precious person. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/141120/The_Boxer", "details": {"title": "The Boxer", "alt_title": "no alt title", "creators": " Jeong, Ji-Hoon (Story & Art)", "summary": "Having suffered ruthless bullying for the better part of his life, 17-year-old Yu has become emotionally numb and dissociated from reality, no longer able to act like a normal human being. Although he possesses the exceptional talent to dodge punches, Yu prefers to let his perpetrators beat him down as he finds no meaning in his survival. Things begin to look up when Yu meets an old boxing trainer nicknamed \"K.\" Having raised five champions, K's years of experience and an impressive gut feeling allow him to recognize Yu's near-superhuman fighting charisma immediately. K rushes to take Yu under his wing, despite the latter's apparent lack of interest. However, after being reminded of a bright memory from the past, Yu has a change of heart and accepts K's offer, hoping to experience the same light once again. Thus, Yu enters a world full of formidable adversaries—righteous and monstrous alike—and for the first time ever, he has no choice but to fight back. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/146878/Return_of_the_Blossoming_Blade", "details": {"title": "Return of the Blossoming Blade", "alt_title": " Return of the Mount Hua Sect, Return of the Flowery Mountain Sect, Hwasan Gwihwan", "creators": " LICO (Art), Biga (Story)", "summary": "When Cheongmyeong of the Mount Hua Sect awakens a hundred years in the future, his last memories are of a bloody battle against the Leader of the Demonic Cult, the evil Cheonma. The battle almost saw the end of the Ten Great Sects of ancient China, when Cheongmyeong ended the hard-fought struggle by striking down Cheonma. Soon after, he succumbed to his wounds, filled with regret at their pyrrhic victory. All is not lost, however, as he awakens to his second chance at life. Shocked to find his beloved Mount Hua Sect reduced to a mere shadow of itself in the present day, Cheongmyeong embarks on a journey to restore Mount Hua to its former glory. (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/111213/Bastard", "details": {"title": "Bastard", "alt_title": " Hulejasig", "creators": " Kim, Carnby (Story), Hwang, Young-chan (Art)", "summary": "There is nowhere that Seon Jin can find solace. At school, he is ruthlessly bullied due to his unsettlingly quiet nature and weak appearance. However, this is not the source of Jin's insurmountable terror: the thing that he fears more than anything else is his own father. To most, Jin's father is a successful businessman, good samaritan, and doting parent. But that is merely a facade; in truth, he is a deranged serial killer—and Jin is his unwilling accomplice. For years, they have been carrying out this ruse with the police being none the wiser. When his father takes an interest in the pretty transfer student Yoon Kyun, Jin must make a decision—be the coward who sends her to the gallows like all the rest, or be the bastard of a son who defies his wicked parent. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/143325/Lost_in_the_Cloud", "details": {"title": "Lost in the Cloud", "alt_title": " Cloud", "creators": " Kim, Pas (Story & Art)", "summary": "Skylar has a secret hobby—taking photos of his crush, Chan-il. But when Cirrus stumbles upon Skylar's cloud storage with its impressive collection of Chan-il's photos, things escalate pretty quickly. At first confident his secret is safe with Cirrus, Skylar continuously finds himself in compromising situations, making him question Cirrus' true motives. (Source: Lezhin Comics)"}}
{"link": "https://myanimelist.net/manga/121269/Who_Made_Me_a_Princess", "details": {"title": "Who Made Me a Princess", "alt_title": " Eoneu Nal Gongjuga Doeeo Beoryeotda, Suddenly Became A Princess One Day", "creators": " Plutus (Story), Spoon (Art)", "summary": "In the novel The Lovely Princess, the secondary character Athanasia de Alger Obelia is the most pitiful of all. Her mother died in childbirth and her father, Emperor Claude, never gave his daughter even an inch of love. Forever yearning for even the slightest bit of parental love, she was ultimately framed for a crime and executed by the orders of her beloved father. When a woman from modern-day Korea falls asleep with some sleeping pills, she later awakens in the infant body of Athanasia. Knowing the unenviable fate that awaits her, she resolves to remain out of her tyrannical father's sight so that she may never incur his wrath. However, fate is not so kind, and she meets him at only five years of age. With her original plan tossed out of the window, she now aims to endear herself so much to her father that he would never dream to hurt her. However, as many work toward their own ends, her plan is thrown into chaos—Athanasia's biological \"sister\" Jennette Margarita longs for a family, high-ranking nobility vie for power, and a shadow from Claude's past threatens to destroy everything he holds dear. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/133641/Villains_Are_Destined_to_Die", "details": {"title": "Villains Are Destined to Die", "alt_title": " Death Is the Only Ending for the Villainess, Agyeok-ui Ending Jugeum-ppun", "creators": " Gwon, Gyeoeul (Story), SUOL (Art)", "summary": "The latest otome game is all the rage recently, so a regular university student decides to see for herself if its fame is well-deserved. She clears the normal mode in no time and finds herself pitying the villainess, Penelope Eckhart. Penelope is a fake―a replacement for the duke's missing daughter, the protagonist of the game. Initially confident about clearing the hard mode as well, the woman is shocked by the sheer leap in the level of difficulty, eventually passing out from exhaustion. However, when she wakes up, she no longer recognizes her surroundings, for she has been reincarnated into the body of the villainess! In a world where everyone seems to be out for her blood, Penelope must make wise decisions that keep her away from the death route. A tyrant prince, a suspicious magician, a nobleman from a fallen nation, or one of her nasty adoptive brothers―whose affections will she win? [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/112370/Spirit_Fingers", "details": {"title": "Spirit Fingers", "alt_title": "no alt title", "creators": " Han, Kyoung-chal (Story & Art)", "summary": "What do you do if you're going on 18, totally awkward and lacking in self- confidence? You could just sit in your room all day and all night and study and wonder why you never get asked out...OR, if you're Amy Song you could join up with the Spirit Fingers—the strangest, hippest, coolest (yet most welcoming) art club ever. But as Amy is about to learn, discovering your TRUE colors is about more than just painting. (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/8586/The_Breaker", "details": {"title": "The Breaker", "alt_title": "no alt title", "creators": " Park, Jin-Hwan (Art), Jeon, Geuk-jin (Story)", "summary": "Yi \"Shioon\" Shi-Woon's everyday life at Nine Dragons High School—which consists of beatings from fellow student Ho Chang and his gang—is far from ideal. But one day, a mysterious man named Han Chun Woo spots one of these beatings and instead of offering support, brands Shioon a coward for refusing to fight back, adding insult to injury. To Shioon's surprise, he finds out that Chun Woo is the new substitute English teacher at his school. Tired of the daily abuse, Shioon decides to enroll at a martial arts academy to learn how to defend himself. On the way there, he stumbles upon Chun Woo in a predicament—cornered in an alley by a group of angry men! Provoked, Chun Woo suddenly dispatches them using martial arts techniques, which Shioon covertly records. Later, he uses this recording to blackmail Chun Woo into teaching him to defend himself. Reluctantly, Chun Woo agrees, and Shioon is soon thrust into the world of martial arts, known as Murim. However, Shioon is naive and unaware of his master's shady past and the unseen underbelly of society. How will Chun Woo manage to teach Shioon and help him survive in the world of Murim? [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/22651/The_Breaker__New_Waves", "details": {"title": "The Breaker: New Waves", "alt_title": " The Breaker 2, The Breaker: NW, The Breaker: Part 2, The Breaker: Martial Arts City", "creators": " Park, Jin-Hwan (Art), Jeon, Geuk-jin (Story)", "summary": "After Yi \"Shioon\" Shi-Woon's master, Goomoonryong, breaks his ki-center, leaving him unable to use his martial arts, he decides to leave the world of Murim and continue on with his normal life: going to school and coming home to his mother every day. However, Murim has other ideas. Discovered as the only true disciple of Goomoonryong and entrusted with the Phoenix Medallion of the Sunwoo Clan by Lady Sosul—making him the interim leader of the Sunwoo Clan—the world of Murim is not so eager to let Shioon leave. With his new status, enemies Shioon has never encountered before keep appearing before him, such as the organization known as Soldiers Under Command. They are intent on getting rid of him for the sake of their own prosperity, but how will Shioon defend himself without his ki-center intact? [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/149493/Daytime_Star", "details": {"title": "Daytime Star", "alt_title": " Naj-e Tteuneun Byeol", "creators": " Chae-eun (Story), Godago (Art)", "summary": "Hwang Yura has always dreamed of becoming a star. Unfortunately, luck does not seem to be on her side, as she has yet to land a major role despite making her debut seven years ago. Still, Yura continues to put her best foot forward and receives a role in a movie destined for success. Much to her dismay, she is once again cast in a minor role. Once on set, Yura runs into two familiar faces—her narcissistic ex-boyfriend Kim Jeong-u and famous actor Kang Seunghyeon. While Yura promises herself to keep her head in the game despite Jeong-u's egotistical presence, the handsome Seunghyeon takes an interest in her due to the circumstances of their previous encounters. Through the strenuous filming, the unknown actress and the lead star form a unique relationship. All the while, Yura tackles the relentless challenges of the entertainment industry on her journey to stardom. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/170427/The_Knight_Only_Lives_Today", "details": {"title": "The Knight Only Lives Today", "alt_title": " Eternally Regressing Knight, A Knight Who Eternally Regresses, Oneul-man Saneun Gisa", "creators": " Soulpung (Story), Ian (Art)", "summary": "\"You're a genius.\" Those words he heard as a child were poison. Encrid dreamed of becoming a knight, but he soon realized it was futile. \"You want to live by the sword with that level of skill?\" Some laughed at him. \"Just give up.\" Some advised him against it. Despite that, his dream remained steadfast. He slept less, ran more, and trained harder. One day, he died, having been stabbed in the neck. Encrid opened his eyes again to \"today's\" morning. (Source: Naver Corporation, translated)"}}
{"link": "https://myanimelist.net/manga/118737/Her_Tale_of_Shim_Chong", "details": {"title": "Her Tale of Shim Chong", "alt_title": " Her Shim Cheong, Geunyeoui Shim Cheong", "creators": " seri (Story), Biwan (Art)", "summary": "Poverty-stricken Shim Chong will do anything to support herself and her blind father, going so far as to steal money from innocent strangers. Meanwhile, the future bride of the local minister lives in luxury, her every need taken care of so long as she remains an obedient wife. When an unfortunate accident leads to their fateful encounter, the pair who have nothing in common find themselves sharing the same wish—to leave their undesirable lives behind and die at the hands of fate. Loosely based on a Korean folktale of the same name, Her Tale of Shim Chong follows two girls from different walks of life as they learn to accept themselves for who they are in a world where women are seen as less than equal. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/122663/Tower_of_God", "details": {"title": "Tower of God", "alt_title": " Sin-ui Tap", "creators": " SIU (Story & Art)", "summary": "Twenty-Fifth Bam had been alone his whole life until he met Rachel. Now, however, Rachel is set on climbing the Tower, and she is willing to leave Bam behind to do so. After Rachel disappears in a veil of light, Bam follows her, vowing to ascend the Tower in hopes of meeting her again. But the Tower is a dangerous place full of ancient secrets, fearsome monsters, and nefarious humans. Each floor is protected by an Administrator who puts the daring challengers through grueling tests that will push them to their limits. As he confronts Headon, the Administrator of the first floor, Bam learns that he is an ''Irregular,'' someone who was not chosen by the Tower but was able to enter it on his own, an extremely rare event inside the Tower. Regardless of this revelation, however, his path forward is clear. Be it wealth, power, glory, or even reuniting with Rachel, all desires will be realized at the top of the Tower. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/131338/Whale_Star__The_Gyeongseong_Mermaid", "details": {"title": "Whale Star: The Gyeongseong Mermaid", "alt_title": " Gorae-byeol, Gorae Byul", "creators": " Na, Yun-hui (Story & Art)", "summary": "\"If the life that you had regained, was one that I had breathed back into you... Is it too much to hope for you to love me back with that life?\" The year is 1926, in Japan-occupied Joseon. 17-year-old Soo-a is an illiterate handmaiden working for the household of a prominent Japanese collaborator. One day, she discovered an injured young man lying unconscious at the beach, an independence activist called Eui-hyeon. The sweet and innocent Soo-a nursed him back to health, and Eui-hyeon told her the tale of the \"Little Mermaid,\" a princess of the sea who saved a prince from his death. Having fallen in love with Eui-hyeon, Soo-a was determined to meet him once again. But she knew not then, of the fate that awaited the \"Little Mermaid\" on her quest to reunite with her beloved. (Source: MU)"}}
{"link": "https://myanimelist.net/manga/147692/I_Shall_Master_This_Family", "details": {"title": "I Shall Master This Family", "alt_title": " In This Life, I Will Be the Lord, I'll Be the Matriarch in This Life, Ibeon Saeng-eun Gaju-ga Doegetseumnida", "creators": " Kim, Roah (Story), Mon (Art)", "summary": "The Lombardis were the most powerful family that ever existed in the empire. With unimaginable wealth, they shaped history, culture, and the arts—their influence rivaling that of the emperor. However, the family collapsed after making an alliance with the first prince, which resulted in futility as the second-born Perez Brivachali Durelli was crowned instead. A Korean woman is reincarnated as Firentia, the daughter of a Lombardi and a commoner. Despite her status as an illegitimate child, her father and grandfather love her, and she works hard to keep her family's prestige intact. After the two pass away, Firentia is kicked out and has since regretted how her relatives have torn the Lombardi name to shreds. On the verge of dying due to a carriage accident, Firentia is mysteriously given another chance in life and wakes up as her seven-year-old self. Firentia will not waste this opportunity, and if she wants to save her father and prevent the Lombardi's fall, she must prove to her grandfather her merit to become the next head of the family. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/154587/Pick_Me_Up", "details": {"title": "Pick Me Up", "alt_title": " Pick Me Up!, Infinite Gacha", "creators": " Wasakbasak (Art), Hermod (Story)", "summary": "In a mobile gacha game infamous for its atrocious difficulty, the master ranked 5th in the world, Loki, loses consciousness while raiding the dungeon. \"What? I'm a game character now?\" After waking up, Loki realizes he has turned into a level 1, 1-star hero—Han Yslat. To return to Earth, he must lead the newbie master and heroes and clear the 100th floor of the dungeon! \"You messed with the wrong guy.\" This is the story of hard carrying by master Loki who never accepts even a single defeat. (Source: Kakao Entertainment Corp., translated)"}}
{"link": "https://myanimelist.net/manga/146909/SSS-Class_Revival_Hunter", "details": {"title": "SSS-Class Revival Hunter", "alt_title": " SSS-Class Suicide Hunter, SSS-geup Jugeoya Saneun Hunter", "creators": " Bill K (Art), Sinnoa (Story)", "summary": "After the Tower suddenly appeared, individuals who wished to pursue their personal values began to inhabit it, coming to be called \"hunters.\" Everyone had their own goals, but only a chosen few were acknowledged and given powerful skills by the mysterious structure. Kim Gong-Ja, a weak F-Class hunter without any skills, is envious of those who were blessed by the Tower. Letting his jealousy overcome him one day, Gong-Ja abruptly receives a S-Class skill that allows him to copy a skill from someone else—after they kill him. Sooner than he likes, Gong-Ja gets to test his newly acquired ability on the legendary hunter known as the Flame Emperor. As he is dying, Gong-Ja learns the evil truth about the man he once admired the most. Receiving another potent skill that allows him to revive and go back in time by 24 hours, Gong-Ja devises a plan to travel 11 years into the past to eliminate the Flame Emperor and cement himself as the world's best hunter. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/148137/Leviathan", "details": {"title": "Leviathan", "alt_title": " DeepWater, Deep Sea Water, Simhaesu", "creators": " Noh, Miyoung (Art), Lee, Gyuntak (Story)", "summary": "The sea level rose to cover the continents. On a planet where dry land can no longer be found, the young Bota's family lives on a small boat and wanders the vast ocean. A harpooner who hunts in deep sea water may be the prey of a monster at any time, those who only appear at night. Will Bota and his family ever make it to safety and escape this aquatic hell?... And who in the world is Kana?! (Source: Toomics)"}}
{"link": "https://myanimelist.net/manga/30079/Annarasumanara", "details": {"title": "Annarasumanara", "alt_title": " The Sound of Magic", "creators": " Ha, Il-Kwon (Story & Art)", "summary": "There is a rumor that a magician lives in the tent by the abandoned theme park; some even say his magic is real. However, before he starts his show, he always asks his audience: \"Do you believe in magic?\" For Yoon Ah-ee, magic seems like a distant memory. Faced with the harsh reality of poverty, she spends all her time studying, working, and taking care of her younger sister in the absence of their parents. She no longer believes in the wonders of magic, just like her skeptical classmate Na Il-Deung, who has been brought up to believe that a good education is the only way to approach life. When Ah-ee stumbles into the abandoned theme park and has a chance encounter with the magician, her life is changed forever. Annarasumanara reveals a philosophical, heartwarming, and thought-provoking story of what it means to grow up into the person you want to be. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/124845/Sweet_Home", "details": {"title": "Sweet Home", "alt_title": "no alt title", "creators": " Kim, Carnby (Story), Hwang, Young-chan (Art)", "summary": "Cha Hyun is a reclusive high school student who spends his days holed up in his room playing video games. But when he loses his entire family in a tragic car accident, he is forced to leave his home and carefree lifestyle behind and move into a new apartment all by himself. However, his pesky neighbors and lack of money soon become the least of his worries as people around him suddenly begin turning into horrifying monsters, plunging the world into apocalyptic chaos. The situation takes a turn for the worse when Hyun realizes that he himself is slowly turning into a monster, while a mysterious voice in his head grows louder and louder. With his time running out, Hyun must work together with his fellow tenants to uncover the cause of the outbreak and find a way to survive in this hopeless new world, all the while fighting to retain his humanity. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/174045/I_Love_Amy", "details": {"title": "I Love Amy", "alt_title": " Naneun Amy-reul Saranghae", "creators": " Unni (Story & Art)", "summary": "Bibi is a bubbly girl who's deeply obsessed with Peter, the cutest boy at her high school. So when she sees a random girl talking to him, Bibi invites her to a sleepover with malicious intent... only to have a surprisingly nice time! That's how she makes friends with Amy, a shy and sweet girl who agrees to help Bibi get with Peter. But as they cook up all sorts of love schemes to win Peter over, Amy's place in Bibi's heart grows bigger and bigger by the day... (Source: Tappytoon)"}}
{"link": "https://myanimelist.net/manga/148234/How_to_Win_My_Husband_Over", "details": {"title": "How to Win My Husband Over", "alt_title": " How to Get My Husband on My Side, Nampyeon-eul Nae Pyeon-euro Mandeuneun Bangbeop", "creators": " Nyangi-wa Hyangsinnyo (Story), Siru (Art)", "summary": "To protect herself from her abusive adoptive family, an orphan mastered the act of being a gleeful and submissive daughter. When she dies in an accident, she believes that she is finally free. However, fate cannot be more cruel; she is reincarnated as Rudbeckia \"Ruby\" de Borgia, a minor villainess from a novel who grows up in a violent household and dies at the hands of her husband. Ruby's father, the power-hungry pope, wishes to ruin the Britanya Kingdom by marrying Ruby off to Britanya's mightiest knight, Iske van Omerta, and having her poison his beloved sister, Elenia. But Ruby knows his plan will ultimately fail, and no member of the Borgias family will escape Iske's wrath and revenge alive. In order to prove her innocence when the time comes, Ruby must act as an oblivious and docile wife, for only by winning her husband over can she hope to survive. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/131008/A_Stepmothers_Märchen", "details": {"title": "A Stepmother's Märchen", "alt_title": " A Stepmother's Fairy Tale, The Fantasie of a Stepmother, Eotteon Gyemo-nim-ui Märchen, Which Stepmother's Märchen", "creators": " Nyangi-wa Hyangsinnyo (Story), ORKA (Art)", "summary": "It is a mystery why the late Marquess Johannes von Neuschwanstein decided to marry a 16-year-old girl barely older than his eldest child. Whatever the reason, Shuli is left to shoulder heavy responsibilities as marchioness after his death. On top of the responsibility to manage a prestigious household with close ties to the empire's royal family, she becomes stepmother to four children who deeply mistrust her. For seven years, Shuli dedicates herself to raising the children well and safeguarding the family fortune. She believes she only has to wait until her son Jeremy will take over as head of the family—then she can live freely. However, on the long-awaited day of his wedding, she is caught up in a tragic accident. When Shuli next opens her eyes, she finds herself in the past, hours before Johannes' funeral. Although uncertain why she has been granted a second chance at life, this time she is determined to build relationships with the children as well as allow for her own happiness. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/168980/Myst_Might_Mayhem", "details": {"title": "Myst, Might, Mayhem", "alt_title": " The Chaotic God of Extraordinary Strength", "creators": " Kim, Tae-Hyung (Art), Hanjung Wolya (Story)", "summary": "Jeong, the Slaughtering Scythe Demon, feels joy in killing others. He happens to look just like Mok Gyeongwoon, the third young master of the Mok Sword Manor... \"Be my substitute, and I'll let you out of prison.\" \"That opportunity. Will you give it to me?\" Crack!!! He kills the Third Young Master and decides to become the real one. Can the fake Mok Gyeongwoon survive as the real one? The serial killer begins his new life as the Third Young Master of the Great Mok Sword Manor. (Source: Naver, translated)"}}
{"link": "https://myanimelist.net/manga/163877/Virtual_Strangers", "details": {"title": "Virtual Strangers", "alt_title": " The Guild Member Next Door, My Guildmate Next Door, Neighbor Guild Member, Iutjip Guild-won", "creators": " Honeytrap (Story), Bijak (Art)", "summary": "After a stalking incident, Yoon Ji-gu has become understandably wary of strangers. So when an odd man moves in next door, he immediately suspects the worst. Little does he know, Yeowoon is just a regular guy trying to land a job and enjoy his free time—until he finds himself dealing with a hostile neighbor. As their real-life misunderstandings escalate, the two unknowingly team up in their favorite online game, forming an unexpected duo. (Source: Lezhin Entertainment)"}}
{"link": "https://myanimelist.net/manga/113555/Kings_Maker", "details": {"title": "King's Maker", "alt_title": "no alt title", "creators": " Haga (Story & Art), Kang, Ji-young (Story & Art)", "summary": "Five years after the mysterious disappearance of the nation's fourth prince, a statement is issued, demanding that any boy found using his name is reported to the authorities. Thus, a manhunt begins for those named Wolfgang. Wolfgang Goldenleonard is well aware of his identity, and he knows that the authorities are still looking for him. He also knows that they mean to end his life. In hiding since the death of his mother, the prince has fostered a bond with the orphans of the streets. However, after threats to them are made, Wolfgang is forced to reveal himself. With his identity publicly revealed, Wolfgang is taken to the home of his tyrannical father. At his father's palace, Wolfgang retains his hatred for the man who gave him life. He refuses to behave as befitting of a Goldenleonard prince and breaks every rule he possibly can. He is often reminded that he is never to covet the king's possessions, but through his rebellious spirit and fiery nature, he has already caught the eyes of the king's favorite catamite, Shin Soohyuk. Shin sees Wolfgang as a force for change, the spark that may just light the fires of rebellion. And with the promise of granting Shin's freedom, Wolfgang agrees to become his pawn. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/166865/The_Extras_Academy_Survival_Guide", "details": {"title": "The Extra's Academy Survival Guide", "alt_title": " How to Survive at the Academy", "creators": " Green Kyrin (Art), Korita (Story)", "summary": "Ed Rothstaylor is a third-rate villain in a game, disowned by his family and kicked out of the dormitory for his misdeeds. One day, our main character wakes up as this very Ed, and realizes he must earn a scholarship so he can graduate and be set for life. Now living in the woods, he resolves to keep away from the protagonists, but four of the female leads just won't leave him alone. Not only that, his presence starts to change the timeline and events of the game! Can Ed help the story progress while staying out of the limelight? (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/146798/Semantic_Error", "details": {"title": "Semantic Error", "alt_title": "no alt title", "creators": " J. Soori (Story), Angy (Art)", "summary": "Chu Sangwoo, a computer science student, is an uncompromising creature of habit who follows a meticulously organized schedule, drinks the same coffee every day, and sits in the same spot in each class. Tasked with doing a group assignment alongside freeloaders, Sangwoo decides that it is only logical not to credit them. However, his strict treatment causes his popular senior Jang Jaeyoung to lose the opportunity to graduate and study abroad. Seeing as he did nothing wrong, Sangwoo avoids Jaeyoung's constant phone calls. As fate would have it, the two men meet when Sangwoo needs a new graphic designer for the 2D game he is making. Jaeyoung is known for his charming personality, but he actually hides a hot temper. Despite his unchanging situation, Jaeyoung cannot stand Sangwoo's apathetic attitude and decides to get revenge by interrupting everything Sangwoo spent years carefully planning. Sangwoo tries his best to keep his calm, but Jaeyoung's presence and attractive smile may prove to be more than just a bug in his perfectly coded life. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/162158/Murderous_Lewellyns_Candlelit_Dinner", "details": {"title": "Murderous Lewellyn's Candlelit Dinner", "alt_title": " Murderer Llewellyn's Enchanting Dinner Invitation", "creators": " Sumnagi (Story), Muk Bu (Art)", "summary": "The apartment complex on the infamous Ira Street is a last resort for those fortunate enough to scrape together a few pennies. People deal with poverty and violence daily, and now a string of murders has solidified fear into their bones. Shavonne, an aspiring young writer, is no exception: he struggles to hold a job, his love life is in shambles, and it seems like he even has a stalker. But the bleakness of his days changes when he meets his next-door neighbor, Lewellyn. Lewellyn is charming and undoubtedly handsome, but he is rather eccentric. Day after day, he sits on the staircase and peels onions, and his wealth is too suspicious for an Ira Street resident. Despite the warning signs, Shavonne accepts a dinner invitation from Lewellyn. However, during the candlelit dinner, Shavonne stumbles upon a mutilated corpse—later discovered as evidence of the Ira Street murderer's latest crime. As Shavonne tiptoes around Lewellyn trying to save his own skin, strange things begin to happen, and he wonders if Lewellyn is his enemy or the only one truly on his side. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/151061/Debut_or_Die", "details": {"title": "Debut or Die!", "alt_title": " If I Fail to Debut, I'll Get a Killer Disease, Debut Mot Hamyeon Jungneun Byeong Geollim", "creators": " Baek, Deoksoo (Story), Soheun (Art)", "summary": "Falling drunk after failing the civil service exam again, Ryu Gunwoo is shocked to wake up in a motel with an unfamiliar appearance. Somehow, not only is he inhabiting the body of Park Moondae—a 20-year-old orphan who took his own life—but he has also regressed three years into the past. Furthermore, he is unable to find information about his original body anywhere. Recovering from his surprise, Moondae wonders if his present situation is similar to the action fantasy novels he knows of. To test his theory, he calls for a status window, which actually appears, albeit bearing the worst news possible: \"Debut or Die.\" Unless he debuts as an idol within a year, he will perish. To avoid his deadly fate, Moondae must secure a spot on the idol survival show Idol Inc. and improve his abilities to the maximum. Due to his past job as a paparazzo, at least Moondae has some insight into the idol experience. However, one wrong step could put his future career—and entire existence—in jeopardy. [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/147062/See_You_in_My_19th_Life", "details": {"title": "See You in My 19th Life", "alt_title": " Let's Meet in the Next Life, Please Take Care of Me in This Life as Well, Ibeon Saengdo Jal Butakhae", "creators": " Lee, Hye (Story & Art)", "summary": "Jieum Ban has an extraordinary ability: she can remember the memories of all her past lives. After her previous life is cut short by a tragic accident, she sets out to reconnect with the people of her past life in her current one. Will memories of her 18th life sabotage romance in her 19th? Or will love endure across different lives? (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/111211/Cheese_in_the_Trap_Season_4", "details": {"title": "Cheese in the Trap Season 4", "alt_title": "no alt title", "creators": " Soonkki (Story & Art)", "summary": "Final season of Cheese in the Trap."}}
{"link": "https://myanimelist.net/manga/118646/Why_Raeliana_Ended_Up_at_the_Dukes_Mansion", "details": {"title": "Why Raeliana Ended Up at the Duke's Mansion", "alt_title": " The Duke's Fiancee, Why She Had to Go to the Duke, The Reason Why Raeliana Ended up at the Duke's Mansion", "creators": " Milcha (Story), Gorae (Art)", "summary": "When Park Eunha dies in modern-day Korea, she awakens in the body of Raeliana McMillan, the eldest daughter of a nouveaux riche baron. However, this is no ordinary world; it's the exact same one as a novel she once read. Beloved by her family, it would seem as though she is in a fairy tale. But Raeliana is far from the main character—she is a mere plot device, whose murder at the hands of her fiancé instigates the entire story. Raeliana has no intention to accept her fate quietly. She sets her eyes on someone in a position of great power—the vieux riche male protagonist Duke Noah Volstaire Wynknight—aiming to completely change the original story. Using her knowledge of future events, Raeliana offers information to Noah on the condition that he acts as her fake fiancé, but the Duke's two-faced nature throws a wrench in her plans! [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/131799/Romance_101", "details": {"title": "Romance 101", "alt_title": " Bareun Yeonae Giljabgi, A Guide to Proper Dating", "creators": " Namsu (Story & Art)", "summary": "University student Jung Bareum always has her days planned. She lives her life to its fullest efficiency and carries out her aims without fail. But while her rigid lifestyle pays off, she lacks one thing: romance! When asked about relationships, Bareum uses her busy schedule as an excuse. However, once Shin Jaehyun, her handsome schoolmate, enters her life, Bareum has a chance to get on track with dating. Bareum joins Jaehyun's small programming club spontaneously in hopes of seeing him more frequently. However, her path to achieving love is not all moonlight and roses. She crosses paths with Na Yuyeon, a fellow club member who likes online games and tends to be late to class. Just by comparing their ways of living, Bareum believes the two will not find any compatibility. But despite being polar opposites, there may lie something special underneath. How can Bareum juggle her schedule, romance, and annoyances? [Written by MAL Rewrite]"}}
{"link": "https://myanimelist.net/manga/107875/Cheese_in_the_Trap_Season_3", "details": {"title": "Cheese in the Trap Season 3", "alt_title": "no alt title", "creators": " Soonkki (Story & Art)", "summary": "Third season of Cheese in the Trap."}}
{"link": "https://myanimelist.net/manga/147863/Nano_Machine", "details": {"title": "Nano Machine", "alt_title": "no alt title", "creators": " Hanjung Wolya (Story), Geumgang Bulgoe (Art)", "summary": "Nanotechnology meets martial arts at the Mashin Academy. Yeo-un's mother may not be one of the High Priest's six official wives, but his father's blood still qualifies him for a chance at the position of Minor Priest. Will a mysterious nanomachine injection from a future descendent help Yeo-un in this fierce competition against his powerful half-siblings? (Source: Webtoon Entertainment)"}}
{"link": "https://myanimelist.net/manga/35171/Cant_See_Cant_Hear_But_Love", "details": {"title": "Can't See Can't Hear But Love", "alt_title": "no alt title", "creators": " Go, Yeong-Hun (Story & Art)", "summary": "Min Geun Soo, a manhwa artist, lives with his special-needs mother who seems to suffer from an intellectual disability and cannot perform the most basic of activities, such as using the toilet or even brushing her teeth. He draws day and night to support them, working himself ragged and straining his eyes in the process. However, one unfortunate day, he completely loses his eyesight. The future seems bleak for a manhwa artist who can no longer draw. All seems to be going downhill, when one day, he meets Jeon So Ri. So Ri is a deaf girl, and happens to be in love with Geun Soo's work. Thus begins a love story between a deaf woman and a blind man about finding the strength and will to live despite numerous trials. [Written by MAL Rewrite]"}}
